Tekla Open API Reference for Tekla Structures 2025
GeometricPlane Methods
The GeometricPlane type exposes the following members.
Methods
Name | Description
GetNormal
 Returns a normalized normal vector of the plane.
Top
See Also
Reference
GeometricPlane Class
Tekla.Structures.Geometry3d Namespace